
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 14 to change, 5 to destroy.</code></pre>

* Create
  * azurerm_linux_virtual_machine.dock-linux[&#34;prddartsmigdock&#34;]
  * azurerm_managed_disk.dock_disk[&#34;prddartsmigdock&#34;]
  * azurerm_network_interface.docker-linux-nic[&#34;prddartsmigdock&#34;]
  * azurerm_virtual_machine_data_disk_attachment.dock_datadisk[&#34;prddartsmigdock&#34;]
* Update
  * azurerm_eventgrid_topic.mig-scanner[0]
  * azurerm_linux_virtual_machine.migration[0]
  * azurerm_linux_virtual_machine.migration-linux[&#34;prddartsmigdb01&#34;]
  * azurerm_linux_virtual_machine.migration-linux2[&#34;prddartsmigdb02&#34;]
  * azurerm_linux_virtual_machine.oracle[&#34;prddartsmigora01&#34;]
  * azurerm_log_analytics_workspace.migration-analytics[0]
  * azurerm_recovery_services_vault.darts-migration-backup[0]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassess&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassure&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig01&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig02&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig03&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig04&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig05&#34;]
* Delete
  * azurerm_backup_protected_vm.mig1[&#34;prddartsmigdock&#34;]
  * azurerm_linux_virtual_machine.migration-linux[&#34;prddartsmigdock&#34;]
  * azurerm_managed_disk.migration_disk[&#34;prddartsmigdock&#34;]
  * azurerm_network_interface.migration-linux-nic[&#34;prddartsmigdock&#34;]
  * azurerm_virtual_machine_data_disk_attachment.mig_datadisk[&#34;prddartsmigdock&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_backup_protected_vm.mig1["prddartsmigdock"] will be destroyed
  # (because key ["prddartsmigdock"] is not in for_each map)
  - resource "azurerm_backup_protected_vm" "mig1" {
      - backup_policy_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupPolicies/darts-prod-policy" -> null
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmigdock/protectedItems/VM;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmigdock" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "darts-prod-rsv" -> null
      - resource_group_name = "darts-migration-prod-rg" -> null
      - source_vm_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdock" -> null
    }

  # azurerm_eventgrid_topic.mig-scanner[0] will be updated in-place
  ~ resource "azurerm_eventgrid_topic" "mig-scanner" {
        id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.EventGrid/topics/darts-event-prod"
        name                          = "darts-event-prod"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_linux_virtual_machine.dock-linux["prddartsmigdock"] will be created
  + resource "azurerm_linux_virtual_machine" "dock-linux" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "prddartsmigdock"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "darts-migration-prod-rg"
      + size                                                   = "Standard_E32ds_v5"
      + tags                                                   = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + virtual_machine_id                                     = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }
    }

  # azurerm_linux_virtual_machine.migration[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/migration-vm"
        name                                                   = "migration-vm"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux["prddartsmigdb01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb01"
        name                                                   = "prddartsmigdb01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux["prddartsmigdock"] will be destroyed
  # (because key ["prddartsmigdock"] is not in for_each map)
  - resource "azurerm_linux_virtual_machine" "migration-linux" {
      - admin_password                                         = (sensitive value) -> null
      - admin_username                                         = "adminuser" -> null
      - allow_extension_operations                             = true -> null
      - bypass_platform_safety_checks_on_user_schedule_enabled = false -> null
      - computer_name                                          = "prddartsmigdock" -> null
      - disable_password_authentication                        = false -> null
      - encryption_at_host_enabled                             = false -> null
      - extensions_time_budget                                 = "PT1H30M" -> null
      - id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdock" -> null
      - location                                               = "uksouth" -> null
      - max_bid_price                                          = -1 -> null
      - name                                                   = "prddartsmigdock" -> null
      - network_interface_ids                                  = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/networkInterfaces/prddartsmigdock-nic",
        ] -> null
      - patch_assessment_mode                                  = "AutomaticByPlatform" -> null
      - patch_mode                                             = "ImageDefault" -> null
      - platform_fault_domain                                  = -1 -> null
      - priority                                               = "Regular" -> null
      - private_ip_address                                     = "10.24.239.167" -> null
      - private_ip_addresses                                   = [
          - "10.24.239.167",
        ] -> null
      - provision_vm_agent                                     = true -> null
      - public_ip_addresses                                    = [] -> null
      - resource_group_name                                    = "darts-migration-prod-rg" -> null
      - secure_boot_enabled                                    = false -> null
      - size                                                   = "Standard_E32ds_v5" -> null
      - tags                                                   = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - virtual_machine_id                                     = "6c2e7c18-6837-4bcc-9164-8e77abee0b07" -> null
      - vtpm_enabled                                           = false -> null

      - identity {
          - identity_ids = [] -> null
          - principal_id = "a1ead6ea-a188-424a-8f9c-5f1f400ec54b" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - os_disk {
          - caching                   = "ReadWrite" -> null
          - disk_size_gb              = 30 -> null
          - name                      = "prddartsmigdock_OsDisk_1_ff657b9cb4f34c96af72770cc1d16a3e" -> null
          - storage_account_type      = "Premium_LRS" -> null
          - write_accelerator_enabled = false -> null
        }

      - source_image_reference {
          - offer     = "0001-com-ubuntu-server-jammy" -> null
          - publisher = "canonical" -> null
          - sku       = "22_04-lts-gen2" -> null
          - version   = "latest" -> null
        }
    }

  # azurerm_linux_virtual_machine.migration-linux2["prddartsmigdb02"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux2" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb02"
        name                                                   = "prddartsmigdb02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.oracle["prddartsmigora01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "oracle" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigora01"
        name                                                   = "prddartsmigora01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_log_analytics_workspace.migration-analytics[0] will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "migration-analytics" {
        id                                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-analytics-workspace"
        name                                    = "darts-migration-analytics-workspace"
      ~ tags                                    = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_managed_disk.dock_disk["prddartsmigdock"] will be created
  + resource "azurerm_managed_disk" "dock_disk" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 200
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "prddartsmigdock-datadisk"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "darts-migration-prod-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Premium_LRS"
      + tags                              = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + tier                              = (known after apply)
    }

  # azurerm_managed_disk.migration_disk["prddartsmigdock"] will be destroyed
  # (because key ["prddartsmigdock"] is not in for_each map)
  - resource "azurerm_managed_disk" "migration_disk" {
      - create_option                     = "Empty" -> null
      - disk_iops_read_only               = 0 -> null
      - disk_iops_read_write              = 1100 -> null
      - disk_mbps_read_only               = 0 -> null
      - disk_mbps_read_write              = 125 -> null
      - disk_size_gb                      = 200 -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmigdock-datadisk" -> null
      - location                          = "uksouth" -> null
      - max_shares                        = 0 -> null
      - name                              = "prddartsmigdock-datadisk" -> null
      - on_demand_bursting_enabled        = false -> null
      - optimized_frequent_attach_enabled = false -> null
      - performance_plus_enabled          = false -> null
      - public_network_access_enabled     = true -> null
      - resource_group_name               = "darts-migration-prod-rg" -> null
      - storage_account_type              = "Premium_LRS" -> null
      - tags                              = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - tier                              = "P15" -> null
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
    }

  # azurerm_network_interface.docker-linux-nic["prddartsmigdock"] will be created
  + resource "azurerm_network_interface" "docker-linux-nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "prddartsmigdock-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "darts-migration-prod-rg"
      + tags                          = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "migration-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.24.239.167"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/migration-subnet-extended"
        }
    }

  # azurerm_network_interface.migration-linux-nic["prddartsmigdock"] will be destroyed
  # (because key ["prddartsmigdock"] is not in for_each map)
  - resource "azurerm_network_interface" "migration-linux-nic" {
      - applied_dns_servers           = [] -> null
      - dns_servers                   = [] -> null
      - enable_accelerated_networking = false -> null
      - enable_ip_forwarding          = false -> null
      - id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/networkInterfaces/prddartsmigdock-nic" -> null
      - internal_domain_name_suffix   = "ugguhk43htce5p1x401cw4ddoa.zx.internal.cloudapp.net" -> null
      - location                      = "uksouth" -> null
      - mac_address                   = "60-45-BD-11-75-32" -> null
      - name                          = "prddartsmigdock-nic" -> null
      - private_ip_address            = "10.24.239.167" -> null
      - private_ip_addresses          = [
          - "10.24.239.167",
        ] -> null
      - resource_group_name           = "darts-migration-prod-rg" -> null
      - tags                          = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - virtual_machine_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdock" -> null

      - ip_configuration {
          - name                          = "migration-ipconfig" -> null
          - primary                       = true -> null
          - private_ip_address            = "10.24.239.167" -> null
          - private_ip_address_allocation = "Static" -> null
          - private_ip_address_version    = "IPv4" -> null
          - subnet_id                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/migration-subnet-extended" -> null
        }
    }

  # azurerm_recovery_services_vault.darts-migration-backup[0] will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "darts-migration-backup" {
        id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv"
        name                          = "darts-prod-rsv"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.dock_datadisk["prddartsmigdock"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "dock_datadisk" {
      + caching                   = "ReadWrite"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 10
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.mig_datadisk["prddartsmigdock"] will be destroyed
  # (because key ["prddartsmigdock"] is not in for_each map)
  - resource "azurerm_virtual_machine_data_disk_attachment" "mig_datadisk" {
      - caching                   = "ReadWrite" -> null
      - create_option             = "Attach" -> null
      - id                        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdock/dataDisks/prddartsmigdock-datadisk" -> null
      - lun                       = 10 -> null
      - managed_disk_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmigdock-datadisk" -> null
      - virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdock" -> null
      - write_accelerator_enabled = false -> null
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsassess"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassess"
        name                                                   = "prddartsassess"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsassure"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassure"
        name                                                   = "prddartsassure"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig01"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig01"
        name                                                   = "prddartsmig01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig02"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02"
        name                                                   = "prddartsmig02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig03"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03"
        name                                                   = "prddartsmig03"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig04"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04"
        name                                                   = "prddartsmig04"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig05"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05"
        name                                                   = "prddartsmig05"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 14 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":221,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->